Revit 2024 API
BuiltInFailures.AssemblyFailures.ElementsNotAllowedAreNotAddedToAssembly Property
 Elements not allowed in Assembly were not added to it, but only in the document
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ElementsNotAllowedAreNotAddedToAssembly { get; }
Visual Basic
Public Shared ReadOnly Property ElementsNotAllowedAreNotAddedToAssembly As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ElementsNotAllowedAreNotAddedToAssembly {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace